import sys, random



print('Welcom to the great name game \n')


arabic_names = (
    'أحمد', 'محمد', 'فاطمة', 'علي', 'نور', 'عمر', 'عائشة', 'حسن', 'أمينة', 'عبدالله',
    'مريم', 'إبراهيم', 'سارة', 'خالد', 'زينب', 'مصطفى', 'ليلى', 'عبدالرحمن', 'فاضل', 'سمية',
    'محسن', 'نادية', 'عبدالملك', 'سعاد', 'عبدالعزيز', 'أماني', 'عبداللطيف', 'هند', 'يوسف',
    'رقية', 'صلاح', 'فاطمة', 'جمال', 'حبيبة', 'معتصم', 'جميلة', 'مجدي', 'عائدة', 'ناجي',
    'عفاف', 'رمضان', 'سميرة', 'أحمد', 'سمر', 'حكيم', 'صباح', 'مجد', 'سعيدة', 'سيد', 'صالحة',
    'رشيد', 'فاطمة', 'حازم'
)

arabic_adjectives = (
    'جميل', 'ذكي', 'سعيد', 'عظيم', 'حكيم', 'صادق', 'مدهش', 'رائع', 'عميق', 'شجاع',
    'طيب', 'حلو', 'سريع', 'طويل', 'صغير', 'غني', 'فقير', 'بسيط', 'عاطفي', 'واضح',
    'ممتع', 'فعال', 'عادل', 'مليء', 'صحي', 'قوي', 'مرح', 'صامت', 'ساحر', 'متفائل',
    'نشيط', 'سهل', 'صبور', 'حر', 'متسامح', 'مبدع', 'حذر', 'متقدم', 'خجول', 'صادق',
    'محظوظ', 'مستقر', 'عابر', 'حاد', 'متواضع', 'سلمي', 'مستعد', 'محبوب', 'حنون', 'واعي'
)

print('Here is your first great name: ')
while True:
    name = random.choice(arabic_names)
    adj = random.choice(arabic_adjectives)

    sys.stderr.write("\033[91m" + "hwlllo" + "\033[0m")
    print("{} {}".format(name, adj), file=sys.stderr)
    print('\n')

    try_again = input("Try again? (Press Enter else n to quite) \n")

    if try_again.lower() == 'n':
        break

input("Press Enter to exit")
